/*:
 # URL Loading System
 
 ## Introduction
 
 Большинство приложений, которые вы скачиваете на на свои iOS девайсы постоянно ходят в сеть для получения новой инофрмации или отправки новых сообщений. Они постоянно обращаются к серверу по тем или иным протоколам, используют попоулярные библиотеки `AFNetwrking` или `Alamofire`.
 
 Дабы ликвидировать недопонимание сетевого взаимодействия в общем и в тонкостях его реализации на iOS я решил написать эту книгу.
*/
/*:
 ## Инструкция к применению
 
 - Включить рендеринг разметки можно во вкледке сврху **Editor / Show Rendered Markup**
 - Включить или остановить выполнение Playground можно по треуглонику Play в баре над **Debug area**. Зажав его можно поменять режимы автоматического выполнения или ручного.
 - Не все Типы о которых будет вестись повествование поддреживают протокол `CustomPlaygroundQuickLookable`, который позволяет выводить информацию об инстансе типа в удобном виде внутри Playground ... 
 
 ## See Also:
 - [URL Session Programming Guide](https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/URLLoadingSystem/URLLoadingSystem.html)
 
 [Next](@next) >
 */
